Narin-Laboratory/libudawa-esp32/src/libudawa.h
/**
 * UDAWA - Universal Digital Agriculture Watering Assistant
 * Function helper library for ESP32 based UDAWA multi-device firmware development
 * Licensed under aGPLv3
 * Researched and developed by PRITA Research Group & Narin Laboratory
 * prita.undiknas.ac.id | narin.co.id
**/

#ifndef libudawa_h
#define libudawa_h

#include <secret.h>
#include <esp32-hal-log.h>
#include <esp_int_wdt.h>
#include <esp_task_wdt.h>
#include <FS.h>
#include <SPIFFS.h>
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <ArduinoJson.h>
#include <StreamUtils.h>
#include <ArduinoOTA.h>
#include <thingsboard.h>
#include <TaskManagerIO.h>
#include "logging.h"
#include "serialLogger.h"
#include <ESP32Time.h>

#define countof(a) (sizeof(a) / sizeof(a[0]))
#define COMPILED __DATE__ " " __TIME__
#define S2_RX 16
#define S2_TX 17
#define WIFI_FALLBACK_COUNTER 3
#ifndef DOCSIZE
  #define DOCSIZE 1024
#endif

#ifndef DOCSIZE_MIN
  #define DOCSIZE_MIN 384
#endif


namespace libudawa
{

const char* configFile = "/cfg.json";
const char* configFileCoMCU = "/comcu.json";
bool FLAG_IOT_SUBSCRIBE = false;
bool FLAG_IOT_INIT = false;
bool FLAG_OTA_UPDATE_INIT = false;
uint8_t WIFI_RECONNECT_ATTEMPT = 0;
uint8_t IOT_RECONNECT_ATTEMPT = 0;
bool WIFI_IS_DEFAULT = false;

struct Config
{
  char hwid[16];
  char name[32];
  char model[16];
  char group[16];
  uint8_t logLev;

  char broker[128];
  uint16_t port;
  char wssid[64];
  char wpass[64];
  char dssid[64];
  char dpass[64];
  char upass[64];
  char accessToken[64];
  bool provSent;

  char provisionDeviceKey[24];
  char provisionDeviceSecret[24];

  int gmtOffset;
  int useCloud = 1;
};

struct ConfigCoMCU
{
  bool fPanic;
  uint16_t bfreq;
  bool fBuzz;
  uint8_t pinBuzzer;
  uint8_t pinLedR;
  uint8_t pinLedG;
  uint8_t pinLedB;
  uint8_t ledON;
};

class GCB {
  public:
    using processFn = JsonObject (*)(const JsonObject &data);

    inline GCB()
      : m_name(), m_cb(NULL)                {  }

    inline GCB(const char *methodName, processFn cb)
      : m_name(methodName), m_cb(cb)        {  }

    const char  *m_name;
    processFn   m_cb;
};

void reboot();
char* getDeviceId();
void cbWifiOnConnected(WiFiEvent_t event, WiFiEventInfo_t info);
void cbWiFiOnDisconnected(WiFiEvent_t event, WiFiEventInfo_t info);
void cbWiFiOnLostIp(WiFiEvent_t event, WiFiEventInfo_t info);
void cbWiFiOnGotIp(WiFiEvent_t event, WiFiEventInfo_t info);
void configLoadFailSafe();
void configLoad();
void configSave();
void configReset();
void configCoMCULoadFailSafe();
void configCoMCULoad();
void configCoMCUSave();
void configCoMCUReset();
bool loadFile(const char* filePath, char* buffer);
callbackResponse processProvisionResponse(const callbackData &data);
void iotInit();
void startup();
void networkInit();
void udawa();
void otaUpdateInit();
void serialWriteToCoMcu(StaticJsonDocument<DOCSIZE_MIN> &doc, bool isRpc);
void serialReadFromCoMcu(StaticJsonDocument<DOCSIZE_MIN> &doc);
void syncConfigCoMCU();
void readSettings(StaticJsonDocument<DOCSIZE> &doc,const char* path);
void writeSettings(StaticJsonDocument<DOCSIZE> &doc, const char* path);
void setCoMCUPin(uint8_t pin, uint8_t op, uint8_t mode, uint16_t aval, uint8_t state);
void rtcUpdate(long ts = 0);
void setBuzzer(int32_t beepCount, uint16_t beepDelay);
void setLed(uint8_t r, uint8_t g, uint8_t b, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay);
void setLed(uint8_t color, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay);
void setAlarm(uint16_t code, uint8_t color, int32_t blinkCount, uint16_t blinkDelay);
void emitAlarm(int code);
void cbSubscribe(const GenericCallback *callbacks, size_t callbacksSize);
void runCb(const char *methodName, JsonObject &params);

ESP32SerialLogger serial_logger;
LogManager *log_manager = LogManager::GetInstance(LogLevel::VERBOSE);
WiFiClientSecure ssl = WiFiClientSecure();
Config config;
ConfigCoMCU configcomcu;
ThingsBoardSized<DOCSIZE_MIN, 64, LogManager> tb(ssl);
volatile bool provisionResponseProcessed = false;
ESP32Time rtc(0);
GCB m_gcb[10];


void cbSubscribe(const GCB *callbacks, size_t callbacksSize)
{
  for (size_t i = 0; i < callbacksSize; ++i) {
    m_gcb[i] = callbacks[i];
  }
}

void runCb(const char *methodName, JsonObject &params){
  for (size_t i = 0; i < sizeof(m_gcb) / sizeof(*m_gcb); ++i) {
    if (m_gcb[i].m_cb && !strcmp(m_gcb[i].m_name, methodName)) {
      log_manager->info(PSTR(__func__), PSTR("calling generic RPC: %s\n"), m_gcb[i].m_name);
      m_gcb[i].m_cb(params);
      break;
    }
  }
}

void emitAlarm(int code){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  doc["alarm"] = code;
  tb.sendTelemetryDoc(doc);
  log_manager->error(PSTR(__func__), PSTR("%i\n"), code);
  JsonObject params = doc.template as<JsonObject>();
  runCb("emitAlarmWs", params);
}

void rtcUpdate(long ts){
  if(ts == 0){
    configTime(config.gmtOffset, 0, "pool.ntp.org");
    struct tm timeinfo;
    if (getLocalTime(&timeinfo)){
      rtc.setTimeStruct(timeinfo);
      log_manager->debug(PSTR(__func__), PSTR("Updated time via NTP: %s GMT Offset:%d (%d) \n"), rtc.getDateTime().c_str(), config.gmtOffset, config.gmtOffset / 3600);
    }
  }else{
      rtc.setTime(ts);
      log_manager->debug(PSTR(__func__), PSTR("Updated time via timestamp: %s\n"), rtc.getDateTime().c_str());
  }
}

void startup() {
  // put your setup code here, to run once:
  Serial.begin(115200);

  config.logLev = 1;
  log_manager->add_logger(&serial_logger);
  log_manager->set_log_level(PSTR("*"), (LogLevel) config.logLev);
  if(!SPIFFS.begin(true))
  {
    //configReset();
    configLoadFailSafe();
    log_manager->warn(PSTR(__func__), PSTR("Problem with file system. Failsafe config was loaded.\n"));
  }
  else
  {
    log_manager->info(PSTR(__func__), PSTR("Loading config...\n"));
    configLoad();
    log_manager->set_log_level(PSTR("*"), (LogLevel) config.logLev);
  }
  #ifdef USE_SERIAL2
    log_manager->debug(PSTR(__func__), PSTR("Serial 2 - CoMCU Activated!\n"));
    Serial2.begin(115200, SERIAL_8N1, S2_RX, S2_TX);
  #endif

  log_manager->debug(PSTR(__func__), PSTR("Startup time: %s\n"), rtc.getDateTime().c_str());

  setAlarm(0, 0, 3, 100);
}

