Narin-Laboratory/libudawa-esp32/src/libudawa.h
void networkInit()
{
  WiFi.onEvent(cbWifiOnConnected, ARDUINO_EVENT_WIFI_STA_CONNECTED);
  WiFi.onEvent(cbWiFiOnDisconnected, ARDUINO_EVENT_WIFI_STA_DISCONNECTED);
  WiFi.onEvent(cbWiFiOnLostIp, ARDUINO_EVENT_WIFI_STA_LOST_IP);
  WiFi.onEvent(cbWiFiOnGotIp, ARDUINO_EVENT_WIFI_STA_GOT_IP);
  WiFi.mode(WIFI_STA);
  if(!config.wssid || *config.wssid == 0x00 || strlen(config.wssid) > 32)
  {
    configLoadFailSafe();
    log_manager->warn(PSTR(__func__), PSTR("SSID too long or missing! Failsafe config was loaded.\n"));
  }
  WiFi.begin(config.wssid, config.wpass);
  WiFi.setHostname(config.name);
  WiFi.setAutoReconnect(true);

  ssl.setCACert(CA_CERT);

  taskManager.scheduleFixedRate(3000, [] {
  if(WiFi.status() == WL_CONNECTED && !tb.connected())
  {
    if(config.useCloud){
      iotInit();
    }
  }
  });

}

void udawa() {
  taskManager.runLoop();
  ArduinoOTA.handle();

  tb.loop();

  if(FLAG_OTA_UPDATE_INIT)
  {
    FLAG_OTA_UPDATE_INIT = 0;
    otaUpdateInit();
  }

  if(FLAG_IOT_INIT && config.useCloud)
  {
    FLAG_IOT_INIT = 0;
    iotInit();
  }
}

void setBuzzer(int32_t beepCount, uint16_t beepDelay){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  JsonObject params = doc.createNestedObject("params");
  doc["method"] = "sBuz";
  params["beepCount"] = beepCount;
  params["beepDelay"] = beepDelay;
  serialWriteToCoMcu(doc, 0);
}

void setLed(uint8_t r, uint8_t g, uint8_t b, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  JsonObject params = doc.createNestedObject("params");
  params["r"] = r;
  params["g"] = g;
  params["b"] = b;
  params["isBlink"] = isBlink;
  params["blinkCount"] = blinkCount;
  params["blinkDelay"] = blinkDelay;
  serialWriteToCoMcu(doc, 0);
}

void setLed(uint8_t color, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay){
uint8_t r, g, b;
  switch (color)
  {
  //Auto by network
  case 0:
    if(tb.connected()){
      r = configcomcu.ledON == 0 ? 255 : 0;
      g = configcomcu.ledON == 0 ? 255 : 0;
      b = configcomcu.ledON;
    }
    else if(WiFi.status() == WL_CONNECTED){
      r = configcomcu.ledON == 0 ? 255 : 0;
      g = configcomcu.ledON;
      b = configcomcu.ledON == 0 ? 255 : 0;
    }
    else{
      r = configcomcu.ledON;
      g = configcomcu.ledON == 0 ? 255 : 0;
      b = configcomcu.ledON == 0 ? 255 : 0;
    }
    break;
  //RED
  case 1:
    r = configcomcu.ledON;
    g = configcomcu.ledON == 0 ? 255 : 0;
    b = configcomcu.ledON == 0 ? 255 : 0;
    break;
  //GREEN
  case 2:
    r = configcomcu.ledON == 0 ? 255 : 0;
    g = configcomcu.ledON;
    b = configcomcu.ledON == 0 ? 255 : 0;
    break;
  //BLUE
  case 3:
    r = configcomcu.ledON == 0 ? 255 : 0;
    g = configcomcu.ledON == 0 ? 255 : 0;
    b = configcomcu.ledON;
    break;
  default:
    r = configcomcu.ledON;
    g = configcomcu.ledON;
    b = configcomcu.ledON;
  }
  StaticJsonDocument<DOCSIZE_MIN> doc;
  doc["method"] = "sLed";
  JsonObject params = doc.createNestedObject("params");
  params["r"] = r;
  params["g"] = g;
  params["b"] = b;
  params["isBlink"] = isBlink;
  params["blinkCount"] = blinkCount;
  params["blinkDelay"] = blinkDelay;
  serialWriteToCoMcu(doc, 0);
}

void setAlarm(uint16_t code, uint8_t color, int32_t blinkCount, uint16_t blinkDelay){
  setLed(color, 1, blinkCount, blinkDelay);
  setBuzzer(blinkCount, blinkDelay);
  if(code > 0){
    emitAlarm(code);
  }
}

void reboot()
{
  log_manager->info(PSTR(__func__),PSTR("Device rebooting...\n"));
  esp_task_wdt_init(1,true);
  esp_task_wdt_add(NULL);
  while(true);
}

char* getDeviceId()
{
  char* decodedString = new char[16];
  uint64_t chipid = ESP.getEfuseMac();
  sprintf(decodedString, "%04X%08X",(uint16_t)(chipid>>32), (uint32_t)chipid);
  return decodedString;
}

void otaUpdateInit()
{
  ArduinoOTA.setHostname(config.name);
  ArduinoOTA.setPasswordHash(config.upass);
  ArduinoOTA.begin();

  ArduinoOTA
    .onStart([]()
    {
      String type;
      if (ArduinoOTA.getCommand() == U_FLASH)
          type = "sketch";
      else // U_SPIFFS
          type = "filesystem";
          SPIFFS.end();
      log_manager->warn(PSTR(__func__),PSTR("Starting OTA %s\n"), type.c_str());
    })
    .onEnd([]()
    {
      log_manager->warn(PSTR(__func__),PSTR("Device rebooting...\n"));
      reboot();
    })
    .onProgress([](unsigned int progress, unsigned int total)
    {
      log_manager->warn(PSTR(__func__),PSTR("OTA progress: %d/%d\n"), progress, total);
    })
    .onError([](ota_error_t error)
    {
      log_manager->warn(PSTR(__func__),PSTR("OTA Failed: %d\n"), error);
      reboot();
    }
  );
}

void iotInit()
{
  int freeHeap = ESP.getFreeHeap();
  log_manager->info(PSTR(__func__),PSTR("Initializing IoT, available memory: %d\n"), freeHeap);
  if(freeHeap < 92000)
  {
    log_manager->warn(PSTR(__func__),PSTR("Unable to init IoT, insufficient memory: %d\n"), freeHeap);
    return;
  }
  if(!config.provSent)
  {
    ThingsBoardSized<DOCSIZE, 64> tbProvision(ssl);
    if(!tbProvision.connected())
    {
      log_manager->info(PSTR(__func__),PSTR("Starting provision initiation to %s:%d\n"),  config.broker, config.port);
      if(tbProvision.connect(config.broker, "provision", config.port))
      {
        log_manager->info(PSTR(__func__),PSTR("Connected to provisioning server: %s:%d\n"),  config.broker, config.port);

        GenericCallback cb[2] = {
          { "provisionResponse", processProvisionResponse },
          { "provisionResponse", processProvisionResponse }
        };
        if(tbProvision.callbackSubscribe(cb, 2))
        {
          if(tbProvision.sendProvisionRequest(config.name, config.provisionDeviceKey, config.provisionDeviceSecret))
          {
            log_manager->info(PSTR(__func__),PSTR("Provision request was sent! Waiting for response.\n"));
            unsigned long timer = millis();
            while(true)
            {
              tbProvision.loop();
              if(millis() - timer > 10000)
              {
                break;
              }
            }
            tbProvision.disconnect();
          }
        }
      }
      else
      {
        log_manager->warn(PSTR(__func__),PSTR("Failed to connect to provisioning server: %s:%d\n"),  config.broker, config.port);
        return;
      }
    }
  }
  else if(config.provSent)
  {
    if(!tb.connected())
    {
      log_manager->info(PSTR(__func__),PSTR("Connecting to broker %s:%d\n"), config.broker, config.port);
      if(!tb.connect(config.broker, config.accessToken, config.port, config.name))
      {
        log_manager->warn(PSTR(__func__),PSTR("Failed to connect to IoT Broker %s [%d/3]\n"), config.broker, IOT_RECONNECT_ATTEMPT);
        IOT_RECONNECT_ATTEMPT++;
        if(IOT_RECONNECT_ATTEMPT >= 60){
          config.provSent = 0;
        }
        return;
      }
      setAlarm(0, 0, 3, 100);
      log_manager->info(PSTR(__func__),PSTR("IoT Connected!\n"));
      IOT_RECONNECT_ATTEMPT = 0;
      FLAG_IOT_SUBSCRIBE = true;
    }
  }
}

